# Aufgaben 4, 7, 8

Bibs

In [34]:
import pandas as pd
import os
%xmode minimal
pd.set_option("mode.copy_on_write", True)

Exception reporting mode: Minimal

Daten laden

In [35]:
url = 'https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv'
file = 'data/titanic_2_original.pickle' # Damit es local gespeichert wird

if os.path.exists(file):
    t = pd.read_pickle(file)
else:
    t = pd.read_csv(url)
    t.to_pickle(file)
t.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
137,138,0,1,"Futrelle, Mr. Jacques Heath",male,37.0,1,0,113803,53.1000,C123,S
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
124,125,0,1,"White, Mr. Percival Wayland",male,54.0,0,1,35281,77.2875,D26,S
782,783,0,1,"Long, Mr. Milton Clyde",male,29.0,0,0,113501,30.0000,D6,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.2500,NaN,S
417,418,1,2,"Silven, Miss. Lyyli Karoliina",female,18.0,0,2,250652,13.0000,NaN,S
371,372,0,3,"Wiklund, Mr. Jakob Alfred",male,18.0,1,0,3101267,6.4958,NaN,S
285,286,0,3,"Stankovic, Mr. Ivan",male,33.0,0,0,349239,8.6625,NaN,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Aufgabe 4 BINS
4.1. LÃ¶sen Sie das Beispiel aus der Vorlesung ohne die Methode pd.cut() zu
verwenden.

In [36]:
import pandas as pd

def age_to_class(age):
    """
    Konvertiert ein Alter in eine Altersklasse.

    Parameter:
    age (int oder float): Das Alter, das konvertiert werden soll.

    RÃ¼ckgabe:
    str: Die entsprechende Altersklasse.
    """
    if age <= 12: return 'child'
    if age <= 18: return 'teenager'
    if age <= 18: return 'worker'
    if age <= 18: return 'elder'
    return pd.NA

# Angenommen, wir haben einen DataFrame 'df' mit einer Spalte 'Age'
df = pd.DataFrame({'Age': [5, 15, 30, 70, 120, -5]})

# Anwenden der Funktion mit map()
df['Age class map'] = df['Age'].map(age_to_class)

# Anwenden der Funktion mit apply()
df['Age class apply'] = df['Age'].apply(age_to_class)

print(df)

   Age Age class map Age class apply
0    5         child           child
1   15      teenager        teenager
2   30          <NA>            <NA>
3   70          <NA>            <NA>
4  120          <NA>            <NA>
5   -5         child           child

4.2. Wir modifizieren die Anforderung leicht, so dass nun zwei Spalten als Input fÃ¼r <br>
die Funktion verwendet werden. Anstelle âadultâ wollen wir âmaleâ / âfemaleâ <br>
entsprechend des âSexâ stehen haben.

In [37]:
import pandas as pd

def age_and_sex_to_class(row):
    """
    Konvertiert Alter und Geschlecht in eine Altersklasse.

    Parameter:
    row (Series): Eine Zeile des DataFrame, die 'Age' und 'Sex' enthÃ¤lt.

    RÃ¼ckgabe:
    str: Die entsprechende Altersklasse.
    """
    age, sex = row['Age'], row['Sex']
    if age >= 0 and age <= 12: return 'child'
    if age > 12 and age <= 18: return 'teenager'
    if age > 18 and age <= 65 and sex == 'male': return 'adult,'+ 'male'
    if age > 18 and age <= 65 and sex == 'female': return 'adult,'+ 'female'
    if age > 65 and age <= 100: return 'elder'
    else:
        return pd.NA

# Beispiel-DataFrame
df = pd.DataFrame({
    'Age': [5, 16, 30, 42, 68, 120, -5],
    'Sex': ['male', 'female', 'male','female', 'female', 'male', 'female']
})

# Anwenden der Funktion mit apply()
df['Age class'] = df.apply(age_and_sex_to_class, axis=1)

print(df)

   Age     Sex     Age class
0    5    male         child
1   16  female      teenager
2   30    male    adult,male
3   42  female  adult,female
4   68  female         elder
5  120    male          <NA>
6   -5  female          <NA>

### 4.3. Bins anhand von Quartilen (qcut())

a) Teilen Sie die âFareâ in die vier Quartile ein. Benennen Sie die Quartile sinnvoll (âbilligâ,
ânormalâ,..). <br> Das Ergebnis sollte eine Spalte im titanic-Datensatz sein, welches das
entsprechende Quartil enthÃ¤lt.

In [38]:
# Namen fÃ¼r Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
t["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)

t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal

b) Wie sind die Quartile definiert (was sind die oberen und unteren Grenzen der âFareâ
jedes Quartils?

Das erste Quartil (billig) umfasst Werte von der niedrigsten 'Fare' bis zum 25. Perzentil. <br>
Das zweite Quartil (normal) reicht vom 25. Perzentil bis zum Median (50. Perzentil). <br>
Das dritte Quartil (teuer) erstreckt sich vom Median bis zum 75. Perzentil. <br>
Das vierte Quartil (sehr teuer) umfasst Werte vom 75. Perzentil bis zur hÃ¶chsten 'Fare'.

c) Was ist der Median von âFareâ?

In [39]:
t['Fare'].median()

14.4542

d) Wiederholen Sie die Aufgabe, aber nun getrennt nach âPclassâ.

In [40]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal

In [43]:
t_group = t.groupby(by=['Pclass'])

In [45]:
t_group.groups.keys()

dict_keys([1, 2, 3])

In [49]:
first_class =t_group.get_group(1)
seccond_class = t_group.get_group(2)
third_class = t_group.get_group(3)

a) wdh

In [52]:
# Namen fÃ¼r Bins
bins = ['billig', 'normal', 'teuer', 'sehr teuer']
first_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)
seccond_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)
third_class["Fare_Bins"] = pd.qcut(t["Fare"], 4, labels=bins)


first_class.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,sehr teuer
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S,teuer
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S,sehr teuer

c) wdh

In [54]:
first_class["Fare"].median()

60.287499999999994

In [55]:
seccond_class["Fare"].median()

14.25

In [56]:
third_class["Fare"].median()

8.05

### 4.4. Alleine oder mit Familie?

a) Berechnen Sie eine Spalte âAloneâ, die anzeigt, ob ein Passagier allein gereist ist oder
mit Familie. <br> Familie wÃ¼rde bedeuten, dass entweder Bruder / Schwester / Ehefrau /
Ehemann oder Eltern / Kinder mit an Bord waren.

In [59]:
# Berechne die 'Alone'-Spalte
# Ein Passagier ist allein, wenn sowohl 'SibSp' als auch 'Parch' gleich 0 sind
t['Alone'] = ((t['SibSp'] == 0) & (t['Parch'] == 0)).astype(int)

In [60]:
t.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_Bins,Alone
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,billig,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,sehr teuer,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,normal,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,sehr teuer,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,normal,1

b) Wie kÃ¶nnte man die Korrektheit dieser Information in den Daten Ã¼berprÃ¼fen?

Man kÃ¶nnte den Nachnamen von Personen mit Familienmitgliedern auf Duplikate prÃ¼fen. Bsp. Ehemann/Frau haben i.d.R. gleichen Nachnamen